fish1=["5~7月 宮前橋 夕方 川虫 底"]
fish2=["オールシーズン　大鏡の手前、真ん中　昼　川虫　かみつぶし極小、小"]
fish3=["7月 大鏡の奥 朝夕 川虫 脈釣り"]
fish4=["6~9月 中流全域 時間不問 おとりアユ 友釣り"]
fish5=["オールシーズン 宮前橋 夕方 川虫 底"]
fish6=["オールシーズン 坊主ヶ淵 朝夕 川虫 脈釣り"]
fish7=["オールシーズン 下流、河口ほぼ全域 朝夕 キジ、イクラ 底より10or20cm上"]
fish8=["オールシーズン 捨て石 夕方 キジ 底"]
fish9=["オールシーズン 初瀬 時間不問 キジ 底から少し上"]
fish10=["オールシーズン 下流~上流の底の外道 キジ中心に大体食いつく"]
fish11=["オールシーズン わんど、よし場 5月以外は朝夕 キジ　底と少し上"]
fish12=["オールシーズン 中流以上、特に上、源流の川虫の朝夕のウキ釣り"]
fish13=["4~6月 宮前橋 時間不問 川虫 底"]
fish14=["3~5月 月見ヶ浜 朝 アオイソメ 投げ釣り80m前後"]
fish15=["オールシーズン 船ヶ淵 朝夕 川虫 底と少し上"]
fish16=["中流以降のキジ、川虫で底を探るといつでもどこでもいる、アブラハヤのついでに釣れる"]
fish17=["オールシーズン よし場 時間不問 キジ、サツマイモ 底"]
fish18=["オールシーズン よし場 時間不問 キジ、サツマイモ 底"]
fish19=["6~9月 月見ヶ浜 時間不問 アオイソメ 投げ釣り9m"]
fish20=["6~9月 月見ヶ浜 朝夕 アオイソメ 投げ釣り9m"]
fish21=["オールシーズン よし場 朝夕3匹ずつ キジ 底 "]
fish22=["3~5月 坊主ヶ淵の左手中央の落ち込み 2時間毎 ビンチョロ・ヒラタ 脈釣り"]
fish23=["6~9月 月見ヶ浜 昼 アオイソメ 投げ釣り9m"]
fish24=["6~9月 月見ヶ浜 朝 アオイソメ 投げ釣り80mから巻く"]
fish25=["オールシーズン 河口全域 朝夕 ルアー釣り 表層を擦る"]
fish26=["オールシーズン よし場 夕1回 ヨシの葉 底"]
fish27=["オールシーズン わんど 時間不問 玉虫 底と少し上"]
fish28=["3~5月の昼、6以降は朝夕 わんど キジ、川虫 底、ウキ下120,130cm"]
fish29=["オールシーズン 船着き場 昼 キジ 底"]
fish30=["5~7月 よし場 朝夕 キジ 底"]
fish31=["3~5月の昼、6以降は朝夕 わんど 川虫 底"]
fish32=["源流以外のあらゆる場所の底で釣れる外道"]
fish33=["オールシーズン よし場 朝夕 キジ、小魚 底"]
fish34=["5~6月 捨て石などの河口、下流 朝夕 キジ 底"]
fish35=["源流以外のあらゆる場所の底で釣れる外道"]
fish36=["オールシーズン 初瀬 夕方 キジ、小魚 底"]
fish37=["3~5月の昼、それ以降朝夕 立木 ダンゴ ウキ下200~300cm"]
fish38=["オールシーズン 月見ヶ浜 朝夕 アオイソメ 投げ釣り9m"]
fish39=["オールシーズン 月見ヶ浜 時間不問 アオイソメ 投げ釣り9m"]
fish40=["5,6月 船ヶ渕 朝夕 キジ、川虫 底と少し上"]
fish41=["3月 わんど 時間不問 キジ ウキ下10cm"]
fish42=["オールシーズン わんど 昼 キジ、川虫 底、ウキ下110,120cm"]
fish43=["オールシーズン　大鏡の手前、真ん中　昼　川虫　かみつぶし極小、小"]
fish44=["オールシーズン わんど 時間不問 玉虫 底と少し上"]
fish45=["6~8月 よし場 夕方 キジ、川虫 ウキ下30cm"]
fishes=fish1+fish2+fish3+fish4+fish5+fish6+fish7+fish8+fish9+fish10+fish11+fish12+fish13+fish14+fish15+fish16+fish17+fish18+fish19+fish20+fish21+fish22+fish23+fish24+fish25+fish26+fish27+fish28+fish29+fish30+fish31+fish32+fish33+fish34+fish35+fish36+fish37+fish38+fish39+fish40+fish41+fish42+fish43+fish44+fish45

print("--------------------")
print("0:アカザ,1:アブラハヤ,2:アマゴ,3:アユ,4:アユカケ,5:イワナ")
print("6:ウグイ,7:ウナギ,8:オイカワ,9:オオヨシノボリ,10:オヤニラミ")
print("11:カジカ,12:カマツカ,13:カレイ,14:カワヒガイ,15:カワムツ")
print("16:キンブナ,17:ギンブナ,18:クサフグ,19:クロダイ,20:コイ")
print("21:サクラマス,22:シマイサキ,23:シロギス,24:スズキ,25:ソウギョ")
print("26:タナゴ,27:タモロコ,28:ツチフキ,29:テナガエビ,30:ドジョウ")
print("31:ドンコ,32:ナマズ,33:ニゴイ,34:ヌマチチブ,35:ハス")
print("36:ヘラブナ,37:ボラ,38:マハゼ,39:ムギツク,40:メダカ")
print("41:モツゴ,42:ヤマメ,43:ヤリタナゴ,44:ワタカ")
print("対象魚")
index = 0
for fish in fishes:
    print(str(index) + '. ' + fish)
    index += 1
print('--------------------')
order = int(input("釣りたい魚を入力してください："))
selected_fish = fishes[order]

print("検索結果："+str(selected_fish))